/*
Марко инвестира 1000.00 евра на штедна книшка и тоа му носи 5%
камата. Да претпоставиме дека целата камата е оставена да лежи
во банката. Пресметај ја и испечати ја вредноста на парите кои
се на сметка на крајот на секоја година во период од 10 години.
За да ја пресметаш сумата користи ја следната формула:
                        s = o(1+r)n
s е сумата на крајот на n-тата година
о е оригиналната (првично ставената) сума
n е бројот на поминати години
r е годишната каматна рата

Решението е дадено со p05_03.c. Бидејќи ова решение бара
вклучување на math.h библиотеките, на многу UNIX C компајлери
ќе биде неопходно да ја вклучиме опцијата –lm при компајлирање
на следниот начин:
gcc –lm p05_03.c
Ова ја поврзува математичката библиотека math.h со програмот

*/

#include <stdio.h>
#include<math.h>

int main()
{
    double amount, principal = 1000.0, rate = 0.05;
    int year;
    printf("%4s%25s\n", "Godina" , "Vrednost na depozitot");
    for(year = 1; year<=10; year++){
        amount = principal*pow(1.0+rate, year);
        printf("%4d%25.2f\n" , year, amount); //%25.2f izramnuvanje od desno a vkupno 25 pozicii, a za levo moze so %-25.2f
    }

    return 0;
}
