/*
1.	Напиши програм кој конвертира целобројни фарантхајтови
температури од 0-212 степени во децимални цезлиусови температури
со 3 цифри прецизност. Да се користи формулата:
celsius = 5.0 /9.0 * (fahrenheit - 32).

Излезот да се испечати во две десно порамнети колони од
по 10 карактери, а целзиусовите вредности треба да се
предводени од знак и за позитивни и за негативни вредности.
*/
#include <stdio.h>

int main()
{
    int farenhajt;
    float celsius;
    printf("Farenhajtovi \t Celsiusovi\n");

    for(int i = 0; i<=212;i++){
        celsius = 5.0/9.0*(i-32);
        printf("%d \t\t%#10.3f \n", i, celsius);
    }


    return 0;
}
